package 프로젝트2차ver2;

public class 도서정보 {

	public static void sortabc() {
		정보[] 도서정보 = new 정보[50];
		도서정보[0] = new 정보("새들이 울었던 자리가 있다", "주희", "해움");
		도서정보[1] = new 정보("마음이 살짝 기운다", "나태주", "알에이치케이");
		도서정보[2] = new 정보("아버지도 나를 슬퍼했다", "김지훈", "꿈공장");
		도서정보[3] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[4] = new 정보("꽃을 보듯 너를 본다", "나태주", "지혜");
		도서정보[5] = new 정보("하얼빈", "김훈", "문학동네");
		도서정보[6] = new 정보("모순", "양귀자", "쓰다");
		도서정보[7] = new 정보("유리알유희", "헤르만헤세", "민음사");
		도서정보[8] = new 정보("아버지의 해방일지", "정지아", "창비");
		도서정보[9] = new 정보("파친코", "이민진", "인플루엔셜");
		도서정보[10] = new 정보("Who Moved My Cheese?", "Dr.Spencer Johnson", "Vermilion");
		도서정보[11] = new 정보("Tuesdays with Morrie", "Mitch Albom", "Bantam Books");
		도서정보[12] = new 정보("Matilda", "Roald Dahi", "Puffin Books");
		도서정보[13] = new 정보("Wonder", "R.J.Palacio", "Corgi Books");
		도서정보[14] = new 정보("Flipped", "Wendelin Van Draanen", "Ember");
		도서정보[15] = new 정보("일본어 무작정 따라하기", "후지이아사리", "길벗");
		도서정보[16] = new 정보("한권으로 끝내기", "이치우", "다락원");
		도서정보[17] = new 정보("굿모닝 독학 일본어 첫걸음", "정선영", "동양books");
		도서정보[18] = new 정보("민나노 독학 일본어 공부", "조수진,장성숙,임성훈", "시사일본어사");
		도서정보[19] = new 정보("일본어 어휘의 달인이 되는법", "강성광", "사람in");
		도서정보[20] = new 정보("논어", "공자", "서울대학교출판문화원");
		도서정보[21] = new 정보("맹자", "맹자", "서울대학교출판문화원");
		도서정보[22] = new 정보("순자", "순자", "을유문화사");
		도서정보[23] = new 정보("대학, 중용", "주희", "홍익출판사");
		도서정보[24] = new 정보("도덕경", "노자", "현암사");
		도서정보[25] = new 정보("철학의 역사", "나이절워버턴", "소소의책");
		도서정보[26] = new 정보("짧고 깊은 철학 50", "톰 버틀러 보던", "흐름출판");
		도서정보[27] = new 정보("너 자신을 알라", "리하르트 다비트 프레히트", "열린책들");
		도서정보[28] = new 정보("러셀 서양 철학사", "버트런드 러셀", "을유문화사");
		도서정보[29] = new 정보("소피의 세계", "요슈타인 가아더", "현암");
		도서정보[30] = new 정보("홈메이드 천연효모로 빵 만들기", "데라모토 고로/야스코", "도림북스");
		도서정보[31] = new 정보("살 만한 것 같다가도 아닌 것 같은", "삼각커피", "상상출판");
		도서정보[32] = new 정보("위대한 중서부의 부엌들", "J.라이언 스트라돌", "열린책들");
		도서정보[33] = new 정보("바베트의 만찬", "노에미비야무사", "문학동네");
		도서정보[34] = new 정보("Food Anatomy/음식해부도감", "줄리아 로스먼", "더숲");
		도서정보[35] = new 정보("인공지능이 스포츠 심판이라면", "스포츠문화연구소", "다른");
		도서정보[36] = new 정보("스포츠사회학", "한국스포츠사회학회", "레인보우북스");
		도서정보[37] = new 정보("Sports Coacthing", "Laura", "Routledge");
		도서정보[38] = new 정보("스포츠의학 세트", "Peter Brukner", "McGraw Hill Korea");
		도서정보[39] = new 정보("운동손상학", "William E.Prentice", "대한미디어");
		도서정보[40] = new 정보("야옹이 수영 교실", "신현경", "북스그라운드");
		도서정보[41] = new 정보("긴긴밤", "루리", "문학동네");
		도서정보[42] = new 정보("하하 자매 떡집", "김리리", "비룡소");
		도서정보[43] = new 정보("5번 레인", "은소홀", "문학동네");
		도서정보[44] = new 정보("기소영의 친구들", "정은주", "사계절");
		도서정보[45] = new 정보("나는 거꾸로 된 나무입니다", "배진시", "책과나무");
		도서정보[46] = new 정보("소여동의 빛", "최이랑", "책담");
		도서정보[47] = new 정보("은유법", "복일경"," 세종마루");
		도서정보[48] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[49] = new 정보("소년이 있었다", "윤혜숙", "서해문집");
		
		정렬메서드.sort(도서정보);
		for(정보 b : 도서정보) {
			System.out.println(b);
		}
		
	}

}
